{"user_id": "18kPq7GPye-YQ3LyKyAZPw", "review_id": "Ya85v4eqdd6k9Od8HbQjyA", "stars": 4, "text": "Mr Hoagie is an institution. Walking in, it does seem like a throwback to 30 years ago, old fashioned menu board, booths out of the 70s, and a large selection of food. Their speciality is the Italian Hoagie, and it is voted the best in the area year after year. I usually order the burger, while the patties are obviously cooked from frozen, all of the other ingredients are very fresh. Overall, its a good alternative to Subway, which is down the road.", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"user_id": "rpOyqD_893cqmDAtJLbdog", "review_id": "5BwtufRF36b-PtZyyS90ug", "stars": 4, "text": "I went there for dinner last night with a client.  This is second time I visited.  I had a scotch and he had a Guiness.  The (-1) is for drink selection. Just stock some better beers and higher end scotch and you're five stars.\n\nWe started with the meatballs covered with Provolone and other blessed goodness.  These did not disappoint.  I had a four cheese pizza with sweet sausage and garlic.  It was fantastic.  They have so many good dishes, but I wanted the pizza last night.  I couldn't finish the pizza - way to go big medium pizza.\n\nI finished up with a coffee.  The parking can be a bit of a challenge on the street, but it's a small town atmosphere in Carnegie, PA.  I love the downtown there.", "business_id": "P1fJb2WQ1mXoiudj8UE44w"}
{"user_id": "4U9kSBLuBDU391x6bxU-YA", "review_id": "3Ngk2ziLJzEGs144XhRxIA", "stars": 4, "text": "So.Much.Fun! \n\nI WISH I could play a song at the drop of a hat. Too bad I never took piano lessons and I'd probably end up mumbling half the lyrics other than the chorus. Unless it's Salt n' Pepa's Shoop. \n\nThis is a really great place to go when you have out of town guests or are looking for a fun place to take someone for a birthday celebration or a fun night out. It's just something different to do other than boozing it up at the bars on a Saturday night. \n\nKeep in mind you'll be paying around a $5-10 cover plus whatever drinks and food you get. The good thing is the food is coming from the attached Rock Bottom Brewery. So a lot of it is restaurant quality good. Plus the brewery beer is actually pretty good! OF course you will be paying restaurant price drinks...so of course they're up charged a bit. But you do pay for the whole experience....so you gotta get into the spirit with some spirits! \n\nThe guys who play are incredibly talented. There's 2 guys that will take requests and play songs on the piano. They pretty much play ANYTHING you ask. Contemporary songs, throw back songs, fight songs, rap songs, pop songs. You name it, they play it. \n\nMy favorite part is when they switch out to another two guys. They'll all four get on stage and play two piano's, a guitar and drums. They usually rock out with some fun familiar songs (um, Journey, of course!). \n\nThe birthday song is seriously the best. They sing to you....and call you some names....with expletives. But in a totally nice way of course. You just have to go!", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww"}
{"user_id": "fHtTaujcyKvXglE33Z5yIw", "review_id": "Di3exaUCFNw1V4kSNW5pgA", "stars": 5, "text": "All the food is great here. But the best thing they have is their wings. Their wings are simply fantastic!!  The \"Wet Cajun\" are by the best & most popular.  I also like the seasoned salt wings.  Wing Night is Monday & Wednesday night, $0.75 whole wings!\n\nThe dining area is nice. Very family friendly! The bar is very nice is well.  This place is truly a Yinzer's dream!!  \"Pittsburgh Dad\" would love this place n'at!!", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"user_id": "SIBCL7HBkrP4llolm4SC2A", "review_id": "BqcMewDQfVWa2pKTFFO4vg", "stars": 3, "text": "Nice enough chain restaurant.  Have ordered the fish tacos appetizer and the dinner entree of cajun fish tacos which comes with black beans and rice.  Both are ok, though I think I'd order something else next time as I'm pretty picky about fish tacos.  \n\nThe appetizer tacos were rather dry.  The cajun tacos were much better but executed oddly.  They come in 2 shells -- an inner hard shell and an outer soft shell.  Why might I ask?  Why add extra calories for something that seems so unnecessary and doesn't add to the dish in any way.  \n\nOh, well.  Can't speak about beer here as I'm not a beer drinker.\n\nThe space is pleasant and our server was efficient even if the meal wasn't the quickest to come to our table even though it wasn't busy.\n\nWould I revisit?  Probably; it was decent enough with many other menu options.  Keep in mind, however, that there are many options nearby worthy of a visit.", "business_id": "McikHxxEqZ2X0joaRNKlaw"}
{"user_id": "8J4IIYcqBlFch8T90N923A", "review_id": "p1j9N_P02v0oN6nWWPwDSg", "stars": 3, "text": "We're lucky to have a waterpark in the Burgh.  I have to keep telling myself that when I want to complain about this place.  I DO think it's a great place to take the fam or even, in my case, spend a day relaxing... if you can!  \n\nLet's do the compliment sandwich.  Positive - negative - positive!  \n\nThe negative... I feel like Sandcastle is the forgotten redheaded stepchild of Kennywood.  They keep pouring money into K-wood, but Sandcastle stays the same year after year.  Now, granted I haven't been there in YEARS, but everything seemed the same as I left it other than one new slide.  I haven't been there in about 9 years.  One new slide in 9 years?  Hmmmmm....\n\nI see major places to improve.  Especially the pool.  I honestly think the slides are great, although you could always add more, they're still fun.  The pool... it's just packed.  So packed that you'd think they'd add a second pool.  Looking around it looks like they have the extra space.  Maybe an adults only pool?  Swimming with 20 zillion kids, plus adults drinking (yes I like that you can bring your bevvie in the pool... but it's kinda weird being around so many kids) and you start to wonder how clean the water is.  I mean, 20 zillion kids you gotta expect a good amount of kiddos are peeing in the pool!  \n\nThe sidewalks are also scalding hot.  I'd assume since many of the people are walking around barefoot you'd be able to custom order some kind of non sun absorbing surface.  And I\"m NOT investing in those dorky water shoes, sorry!  \n\nI'm ALWAYS happy to see a Potato Patch stand!  Just as good as K-wood!  They also serve chicken tender, which is nice if you want a little meat to add on.  Nothing more is needed for me!  Although the frozen drinks looked tasty and tempting, it was so hot out I was just downing water by the gallons.  You're also allowed to bring in your own snacks and food, which I think is nice for families who want to save a little mola.  \n\nAgain, Sandcastle is so awesome to have in the Burgh, it would be nice to see improvements.  It always seems packed in the summer months, so why not keep on improving it?  Or maybe they think don't fix what's not broken.  I just may stick to a cleaner, less pee filled community pool for my water fun fix!", "business_id": "uI0LvTXFACid1308KFO5ew"}
{"user_id": "ysYmC-ufbdmVEX9yAv-VEQ", "review_id": "yGPdA_RETILjRiTPPX7ObA", "stars": 4, "text": "Target is pretty standard. If you've been to one of them, you'll know largely what to expect from this one. That being said, this store is clean, and the deals one clearance can be good. Just make sure to check the circular and the website, as sometimes additional coupons can be found that the store personnel aren't aware of. \n\nThe electronics department staff are not very knowledgeable, and tried to pressure me into buying a different TV by repeating marketing lingo, but were unable to explain what their claims actually were when challenged on them, so make sure to do your research beforehand if purchasing electronics.",  "business_id": "ISKLP0qxApATxRlUDob6Cg"}
{"user_id": "WPOKvkacSKHx_bIG1alFiA", "review_id": "Ieh3kfZ-5J9pLju4JiQDvQ", "stars": 5, "text": "I highly recommend this place. The mechanics are really honest and I'm usually in and out with no issues.", "business_id": "3eu6MEFlq2Dg7bQh8QbdOg"}
{"user_id": "UTS9XcT14H2ZscRIf0MYHQ", "review_id": "WlTNaqRuQ2HTeoXUp36ZYQ", "stars": 4, "text": "This was a great find near Pittsburgh alternative to down town scene. Ambiance was great on the deck by the river, and service was excellent (Thanks Melisa for history lessens!). Seafood including Oysters were fresh and well prepared. Price was reasonable for \"Prefix\" menu including scrumptious dessert.  What an evening to end a fantastic summer day in Pittsburgh.", "business_id": "usSROUMiAgPcxV3Ym0OxMQ"}
{"user_id": "qL7Astun3i7qwr2IL5iowA", "review_id": "XsA6AojkWjOHA4FmuAb8XQ", "stars": 3, "text": "Decent range somewhat close to the city.  The mats are pretty solid; however, the grass range needs to be tended too.  It's like hitting out of US Open type rough...not very amenable to practicing.  Which kind of defeats the purpose of going to a golf range...Still gets 3 stars because the range is lit up at night which is excellent for those of us who are addicted to this amazing game, but are somewhat short on time (having a job kinda sucks sometimes, no?).", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
{"user_id": "ZWOj6LmzwGvMDh-A85EOtA", "review_id": "KsAOwCyGwv4IXG_HqH_5RA", "stars": 5, "text": "D's is always worth the trip, whether you're stopping by for some food or heading straight to the beer cave to build your own six pack. Maybe it attracts a certain kind of younger crowd, but it is truly a no-frills kind of place and the people working there could not be more friendly and accommodating. The first time I came here our server was super chill and chatty with us as well as patient while we took our time figuring out how many add-ons to pile on top of our food despite the busy atmosphere of the place.\n\nThe food is cheap and hits the spot, for meat eaters and vegetarians alike. I will say their seitan wings were particularly crunchy/dry and not altogether satisfying shared between people, but the flavors were great.\n\nBut let's be real, you're probably coming here for the dogs. It's cool, I do too. And you will probably want to add avocado to whatever it is you're getting, because avocado is for winners, just like the ocean.\n\nOne night, during some seriously biblical amounts of rain and lightning, the power went out temporarily and workers and patrons alike kept on going like it was -no big deal-, demonstrating that the strength of D's can weather any storm.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g"}
{"user_id": "HDQixQ-WZEV0LVPJlIGQeQ", "review_id": "PbWEd0YnpqYu7YXRNyoqkw", "stars": 3, "text": "Lincoln Bakery is yet another local bakery I've been meaning to try.  When a Google Offer came up, I took it so I would have no excuse to keep avoiding it.  The place has a nice neighborhood bakery feel; as I took in the many selections it seemed that everyone who came in was a regular.  There weren't many people when I was there (it was still relatively early) but I got the impression that at times there can be a line to the door.  \nOne thing that I didn't like was although they had many pastries to choose from, nothing was labeled.  So I had to keep asking what things were.  The cinnamon roll was okay, nothing spectacular.  But the pastries I got were very good.  I'd recommend checking it out.  I know if I'm ever in the neighborhood I will stop in for a treat myself.", "business_id": "7wT532x2Qz5Hw9BqtBapqw"}
{"user_id": "za5Q2uYrTmky9w_3h9k_wQ", "review_id": "jzDXaYoAKszVpmKDmnP1gw", "stars": 5, "text": "Being from Illinois and in town to attend a Steelers game we needed beer.  Found out grocery stores only sell basically a 12 pack per person/visit. Nothing like Illinois where the sky's the limit. So after that education we ended up here.  Good selection of beer when you need more quantities that 2 six packs.  We stocked up on IC light and was reasonably priced.  Friendly service.  Only con is parking is scarce but that seems to be par for the course in Pittsburgh.  I would visit again if in the area.","business_id": "s74Tq6WKV1b91UFRr7ch7g"}
{"user_id": "HI-QmpsYxP5AJtRPanXKQw", "review_id": "AuPwO6OkHzJ0pEw1cL5h8A", "stars": 5, "text": "The coffee here was excellent! Had a double espresso. Apparently their roaster is in Santa Cruz Ca. Large selection of French Press Coffees. Baked goods did not look too great but that is not why I came here. Atmosphere is very mellow and comfortable. Also has Wifi which works! Nice to find a place like this when traveling. Is in the middle of a residential area and there doesnt seem to be anything else around here.", "business_id": "83_p9vIqOq1TUIf3_GD7bA"}
{"user_id": "HZJ9qzZlXC8xeC8v7VT8WA", "review_id": "fBQ69-NU9ZyTjjS7Tb5tww", "stars": 5, "text": "THANK YOU ROB! i truly appreciated all the help i received from this agent today who was able to removed the extra charges on my bill that the Pasadena Verizon Store on Lake was charging me on my bill for upgrading my phone.   When i went in i was having problems with my Blacberry and had to switch to the Iphone last week. Rob from the Pennsylvania store who i was connected today was able to look at my bill and all the notes and correct the problem immediately. Great Customer Service! He even set up a FOLLOW UP Phone Call with me On July 5th to make sure the credit goes through on my bill...I can't thank him enough!!!!",  "business_id": "HZdLhv6COCleJMo7nPl-RA"}
{"user_id": "y6tOSRh3Xng3XKjVFoE2qw", "review_id": "ON-0sO2Srv5cKofdzZ36HA", "stars": 5, "text": "It's hard enough finding a good mechanic period. But to find one that's friendly and reasonably priced is unheard of. I've been loyal to Tim for the last 4 years and he's never let me down. If there's one complaint it's that things can sometimes take a little longer than expected, but this is a minuscule \"con\" in an ocean of \"pros.\" At one time, I needed a new flex pipe put on my exhaust, Tim recommended that I go to a neighboring shop to get the exhaust work done because \"it would be too expensive if I did it.\" This was something I've never encountered. A mechanic recommending another place to do business??? Do yourself a favor and give this place your business. Your car might be out of commission for a few days, but the comfort of knowing you're not being swindled is absolutely worth it.", "business_id": "WWlNzfSllSQhr4whj0W_ng"}
{"user_id": "AzoZZ1hRToPsnUPXeRXelg", "review_id": "-zBwLE5jy5M4IzbXshDvIg", "stars": 5, "text": "This church seems to have it all, great preaching, amazing choir and they seem to be servicing the community in so many wonderful ways. Honestly I can't say enough great things about this church. Love it!", "business_id": "fp-tknN_5XBmhUS4fSJBgQ"}
{"user_id": "4mk28YCp7kCKI6WUp3Gl7w", "review_id": "122uxUnfVHQE2DtFWjoggg", "stars": 5, "text": "Forget you Giant Eagle, Giggle, Market Crap etc.  Whole foods gets a bad rap as being \"expensive\" and yes I agree there are some very ridiculously expensive things in there, but this is where you IGNORE them and get your basic essentials.  They are always running specials, and you can get some good deals.  If you actually try to price compare between GE and whole foods, you'll find that whole foods is actually cheaper, and the only reason you don't shop there is because people will feed you into thinking you'll spend your \"whole paycheck\" there.  What crap.  Write a list, prioritize and buy the things that are sale.  Whole foods has a much better selection (freshness wise) in produce, meats, and cheese across the board.  Yes you can find some great stuff in the strip, but you will also find some reasonable items here.  Over the summer I went on a scavenger hunt for clams, Wholeys/GE were both gross and overpriced! Whole foods has fresh clams and they were much cheaper than the other two locations!  Try it out, you won't be sorry.",  "business_id": "wfCLz9-aeShbPB7CaTY-qQ"}
{"user_id": "3ctGjRh7NaXZ-Gr34A5b6A", "review_id": "YVOk9ylo8bgaxwFbdNrouA", "stars": 5, "text": "I recently realized that I had only given Casbah four stars after my first visit here for New Year's Eve 2012... What a terrible judgment call that was on my part. So I'm back to proclaim that over a year later - having dined here again in 2013 - with a year of dining experiences across the country -  I still regularly dream of this restaurant. Do I dare say it's my favorite restaurant? I'm not sure, but if it's not my favorite, it's certainly close.\n\nWe returned after NYE last year to celebrate my birthday in March, making sure to bring along the oh-so-coveted Big Burrito birthday coupon. I ordered the Orecchiette with Chicken, Cranberries, Goat Cheese & Sage Cream. Oh. My. Goodness. Don't order this if you're on a diet... but order this if you love delicious food and living life to the fullest. It was ridiculously creamy, and the cranberries packed the perfect fruity balance to the rich dish. My husband ordered the Double-Cut Pork Chop with Kale & Butternut Squash Risotto. While recently dining at a highly rated restaurant in NYC, he said, \"My double-cut pork chop at Casbah was better than this double-cut pork chop.\" That's when I knew that I needed to update my review of Casbah.\n\nFinally, my delicious birthday dinner ended with the Dark Chocolate-Raspberry Bread Pudding. I love ordering bread pudding at restaurants, and I think this is the best of them all. I would confidently enter this dessert in a bread pudding competition, knowing that I would be walking away with the blue ribbon.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A"}
{"user_id": "rYI9SVnGuPcWyhr1RiZgaw", "review_id": "6w6gMZ3iBLGcUM4RBIuifQ", "stars": 5, "text": "This place was DELICIOUS!!  My parents saw a recommendation to visit this place from Rick Sebak's \"25 Things I Like About Pittsburgh\" and he's usually pretty accurate.  His recommendations were to try the Reuben, Fish Sandwich and Open-Faced Steak Sandwich.  We went early afternoon for a late lunch today (a Saturday) and were seated right away.  The staff is extremely friendly.  My Mom & I each had the fish sandwich, while my Dad & Brother had a Reuben sandwich.  The fish was very good, but the Reuben was to die for!  Both dishes were massive, and could very easily be shared between two people.  On top of being extremely large portions, it was incredibly affordable.  The giant fish sandwich was $8 and the giant Reuben was $7.50.  Our drinks were always filled and we were checked on several times during the meal.  We will definitely be back!!!  Oh and a bit of advice ahead of time - they take CASH ONLY.  So come prepared, but I'm pretty sure I saw an ATM there as well.  And I do believe they are closed on Sundays & Mondays.", "business_id": "mVHrayjG3uZ_RLHkLj-AMg"}












